{
    "architectures": [
      "MistralForCausalLM"
    ],
    "bos_token_id": 2,
    "eos_token_id": 3,
    "pad_token_id": 0,
    "hidden_act": "silu",
    "hidden_size": 1024,
    "initializer_range": 0.02,
    "intermediate_size": 2400,
    "max_position_embeddings": 8192,
    "model_type": "mistral",
    "num_attention_heads": 16,
    "num_hidden_layers": 24,
    "num_key_value_heads": 8,
    "rms_norm_eps": 1e-05,
    "rope_theta": 10000.0,
    "sliding_window": 1024,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.35.2",
    "use_cache": true,
    "vocab_size":32000
  }